# 하나만 출력합니다.
print("# 하나만 출력합니다")
print("Hello Python Programming...!")
print()

# 여러 개를 출력합니다. print함수의 경우 문자열일때만 ""을 사용하고 문자열이 아닌 숫자열을 입력할때는 ""를 사용하지 않아도 된다. 단 True나 False나 그러한 값을 만들어 내는 경우는 ""를 사용하지 않아도 된다.
# ""을 사용한다는것은 문자열을 출력 하겠다는 것인데, ""대신 ''가 쓰여도 똑같은 결과를 낸다. 
# ,를 이용하여 여러 문자열을 출력할수있다.
print("# 여러 개를 출력합니다.")
print(10, 20, 30, 40, 50)
print("안녕하세요", "저의", "이름은", "강성제입니다!!") # print("안녕하세요 저의 이름은 강성제입니다!!")
print()

# 아무것도 출력하지 않으면 단순하게 줄바꿈합니다.
print("# 아무것도 출력하지 않습니다.")
print("--- 확인 전용선 ---")
print()
print()
print("--- 확인 전용선 ---")